{
    "restest": {
        "properties": "",
        "results": ""
    },
    "types": {
        "part": "text",
        "channelId": "text",
        "channelType": "enum",
        "eventType": "enum",
        "forContentOwner": "enum",
        "forDeveloper": "enum",
        "forMine": "enum",
        "location": "text",
        "locationRadius": "text",
        "maxResults": "number",
        "onBehalfOfContentOwner": "text",
        "order": "enum",
        "pageToken": "text",
        "publishedAfter": "text",
        "publishedBefore": "text",
        "q": "text",
        "regionCode": "text",
        "relatedToVideoId": "text",
        "relevanceLanguage": "text",
        "safeSearch": "enum",
        "topicId": "text",
        "type": "text",
        "videoCaption": "enum",
        "videoCategoryId": "text",
        "videoDefinition": "enum",
        "videoDimension": "enum",
        "videoDuration": "enum",
        "videoEmbeddable": "enum",
        "videoLicense": "enum",
        "videoSyndicated": "enum",
        "videoType": "enum"
    },
    "descriptions": {
        "part": "The *part* parameter specifies a comma-separated list of one or more search resource properties that the API response will include. Set the parameter value to snippet.",
        "channelId": "Filter on resources belonging to this channelId.",
        "channelType": "Add a filter on the channel search.",
        "eventType": "Filter on the livestream status of the videos.",
        "forContentOwner": "Search owned by a content owner.",
        "forDeveloper": "Restrict the search to only retrieve videos uploaded using the project id of the authenticated user.",
        "forMine": "Search for the private videos of the authenticated user.",
        "location": "Filter on location of the video",
        "locationRadius": "Filter on distance from the location (specified above).",
        "maxResults": "The *maxResults* parameter specifies the maximum number of items that should be returned in the result set.",
        "onBehalfOfContentOwner": "*Note:* This parameter is intended exclusively for YouTube content partners. The *onBehalfOfContentOwner* parameter indicates that the request's authorization credentials identify a YouTube CMS user who is acting on behalf of the content owner specified in the parameter value. This parameter is intended for YouTube content partners that own and manage many different YouTube channels. It allows content owners to authenticate once and get access to all their video and channel data, without having to provide authentication credentials for each individual channel. The CMS account that the user authenticates with must be linked to the specified YouTube content owner.",
        "order": "Sort order of the results.",
        "pageToken": "The *pageToken* parameter identifies a specific page in the result set that should be returned. In an API response, the nextPageToken and prevPageToken properties identify other pages that could be retrieved.",
        "publishedAfter": "Filter on resources published after this date.",
        "publishedBefore": "Filter on resources published before this date.",
        "q": "Textual search terms to match.",
        "regionCode": "Display the content as seen by viewers in this country.",
        "relatedToVideoId": "Search related to a resource.",
        "relevanceLanguage": "Return results relevant to this language.",
        "safeSearch": "Indicates whether the search results should include restricted content as well as standard content.",
        "topicId": "Restrict results to a particular topic.",
        "type": "Restrict results to a particular set of resource types from One Platform.",
        "videoCaption": "Filter on the presence of captions on the videos.",
        "videoCategoryId": "Filter on videos in a specific category.",
        "videoDefinition": "Filter on the definition of the videos.",
        "videoDimension": "Filter on 3d videos.",
        "videoDuration": "Filter on the duration of the videos.",
        "videoEmbeddable": "Filter on embeddable videos.",
        "videoLicense": "Filter on the license of the videos.",
        "videoSyndicated": "Filter on syndicated videos.",
        "videoType": "Filter on videos of a specific type."
    },
    "api_keys": [
        "key"
    ],
    "class_weight": "balanced",
    "sample_method": "smote"
}