{
    "restest": {
        "properties": "",
        "results": ""
    },
    "types": {
        "allThreadsRelatedToChannelId": "text",
        "channelId": "text",
        "id": "text",
        "maxResults": "number",
        "moderationStatus": "enum",
        "order": "enum",
        "pageToken": "text",
        "part": "text",
        "searchTerms": "text",
        "textFormat": "enum",
        "videoId": "text"
    },
    "descriptions": {
        "allThreadsRelatedToChannelId": "The allThreadsRelatedToChannelId parameter instructs the API to return all comment threads associated with the specified channel. The response can include comments about the channel or about the channel's videos.",
        "channelId": "The channelId parameter instructs the API to return comment threads containing comments about the specified channel. (The response will not include comments left on videos that the channel uploaded.)",
        "id": "The id parameter specifies a comma-separated list of comment thread IDs for the resources that should be retrieved.",
        "maxResults": "The maxResults parameter specifies the maximum number of items that should be returned in the result set.  Note: This parameter is not supported for use in conjunction with the id parameter.",
        "moderationStatus": "Set this parameter to limit the returned comment threads to a particular moderation state.  Note: This parameter is not supported for use in conjunction with the id parameter.",
        "order": "The order parameter specifies the order in which the API response should list comment threads. Valid values are: - time - Comment threads are ordered by time. This is the default behavior. - relevance - Comment threads are ordered by relevance.Note: This parameter is not supported for use in conjunction with the id parameter.",
        "pageToken": "The pageToken parameter identifies a specific page in the result set that should be returned. In an API response, the nextPageToken property identifies the next page of the result that can be retrieved.  Note: This parameter is not supported for use in conjunction with the id parameter.",
        "part": "The part parameter specifies a comma-separated list of one or more commentThread resource properties that the API response will include.",
        "searchTerms": "The searchTerms parameter instructs the API to limit the API response to only contain comments that contain the specified search terms.  Note: This parameter is not supported for use in conjunction with the id parameter.",
        "textFormat": "Set this parameter's value to html or plainText to instruct the API to return the comments left by users in html formatted or in plain text.",
        "videoId": "The videoId parameter instructs the API to return comment threads associated with the specified video ID."
    },
    "api_keys": [
        "key"
    ],
    "class_weight": "balanced",
    "sample_method": "smote"
}